railsgirls/app/views/ideas/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 8]]
---
			<% end %>
			<strong><%= idea.comments.count %> comments  </strong>