railsgirls/app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT "comments".* FROM "comments" ORDER BY "comments"."created_at" DESC

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("user_name", "body", "idea_id", "created_at", "updated_at", "rating") VALUES (?, ?, ?, ?, ?, ?)  [["user_name", "Jaseera"], ["body", "good ond"], ["idea_id", 1], ["created_at", "2018-05-23 15:46:31.983775"], ["updated_at", "2018-05-23 15:46:31.983775"], ["rating", 4]]

  def update
    respond_to do |format|
      if @comment.update(comment_params)
---
UPDATE "comments" SET "user_name" = ?, "body" = ?, "rating" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_name", "Ruby"], ["body", "Good"], ["rating", 3], ["updated_at", "2018-05-23 15:46:47.819705"], ["id", 6]]

  def set_comment
    @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? ORDER BY "comments"."created_at" DESC LIMIT ?  [["id", 49], ["LIMIT", 1]]