railsgirls/app/controllers/ideas_controller.rb

  def index
    @ideas = Idea.all
---
SELECT "ideas".* FROM "ideas" ORDER BY "ideas"."created_at" DESC

  def show
    @comments = @idea.comments.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ? ORDER BY "comments"."created_at" DESC  [["idea_id", 8]]
SELECT AVG(no_of_stars) FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 1]]

  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "testing"], ["description", "none"], ["created_at", "2018-05-17 08:38:54.709077"], ["updated_at", "2018-05-17 08:38:54.709077"]]

  def update
    respond_to do |format|
      if @idea.update(idea_params)
---
UPDATE "ideas" SET "name" = ?, "description" = ?, "picture" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["name", "Idea one"], ["description", "This is my idea"], ["picture", "download__1_.jpg"], ["updated_at", "2018-05-21 08:53:14.582408"], ["id", 1]]

  def set_idea
    @idea = Idea.find(params[:id])
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? ORDER BY "ideas"."created_at" DESC LIMIT ?  [["id", 8], ["LIMIT", 1]]